52n-oxf-adapters/oxf-ses-adapter/src/main/resources/org/n52/oxf/ses/client/template_destroyregistration.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2">
    <soap:Header>
        <wsa:To>${reg_pub_host}</wsa:To>
        <wsa:Action>http://docs.oasis-open.org/wsn/brw-2/PublisherRegistrationManager/DestroyRegistrationRequest
</wsa:Action>
        <wsa:MessageID>uuid:4e595160-185a-9b3c-3eb6-592c7c5b0c7a</wsa:MessageID>
        <wsa:From>
            <wsa:Address>http://www.w3.org/2005/08/addressing/role/anonymous</wsa:Address>
        </wsa:From>
        <muse-wsa:ResourceId xmlns:muse-wsa="http://ws.apache.org/muse/addressing" wsa:IsReferenceParameter="1">${resource}</muse-wsa:ResourceId>
    </soap:Header>
    <soap:Body>
        <wsnbr:DestroyRegistration xmlns:wsnbr="http://docs.oasis-open.org/wsn/br-2" />
    </soap:Body>
</soap:Envelope>